MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2025DAA288/mcu.h
extern volatile __USBIENCSR3bits_t USBIENCSR3bits __asm__ ("USBIENCSR3") __attribute__((section("sfrs"), address(0xBF8E301C)));
#define DEVCFG4 DEVCFG4
extern volatile uint32_t   DEVCFG4 __attribute__((section("sfrs"), address(0xBFC0FFBC)));
typedef union {
  struct {
    uint32_t :24;
    uint32_t SWDTPS:5;
  };
  struct {
    uint32_t w:32;
  };
} __DEVCFG4bits_t;
extern volatile __DEVCFG4bits_t DEVCFG4bits __asm__ ("DEVCFG4") __attribute__((section("sfrs"), address(0xBFC0FFBC)));
#define DEVCFG3 DEVCFG3
extern volatile uint32_t   DEVCFG3 __attribute__((section("sfrs"), address(0xBFC0FFC0)));
typedef union {
  struct {
    uint32_t USERID:16;
    uint32_t EXTDDRSIZE:4;
    uint32_t :4;
    uint32_t FMIIEN:1;
    uint32_t FETHIO:1;
    uint32_t :1;
    uint32_t PGL1WAY:1;
    uint32_t PMDL1WAY:1;
    uint32_t IOL1WAY:1;
  };
  struct {
    uint32_t w:32;
  };
} __DEVCFG3bits_t;
extern volatile __DEVCFG3bits_t DEVCFG3bits __asm__ ("DEVCFG3") __attribute__((section("sfrs"), address(0xBFC0FFC0)));
#define DEVCFG2 DEVCFG2
extern volatile uint32_t   DEVCFG2 __attribute__((section("sfrs"), address(0xBFC0FFC4)));
typedef union {
  struct {
    uint32_t FPLLIDIV:3;
    uint32_t :1;
    uint32_t FPLLRNG:3;
    uint32_t FPLLICLK:1;
    uint32_t FPLLMULT:7;
    uint32_t :1;
    uint32_t FPLLODIV:3;
    uint32_t VBATBOREN:1;
    uint32_t DSBOREN:1;
    uint32_t DSWDTPS:5;
    uint32_t DSWDTOSC:1;
    uint32_t DSWDTEN:1;
    uint32_t FDSEN:1;
    uint32_t :1;
    uint32_t UPLLFSEL:1;
  };
  struct {
    uint32_t w:32;
  };
} __DEVCFG2bits_t;
extern volatile __DEVCFG2bits_t DEVCFG2bits __asm__ ("DEVCFG2") __attribute__((section("sfrs"), address(0xBFC0FFC4)));
#define DEVCFG1 DEVCFG1
extern volatile uint32_t   DEVCFG1 __attribute__((section("sfrs"), address(0xBFC0FFC8)));
typedef union {
  struct {
    uint32_t FNOSC:3;
    uint32_t DMTINTV:3;
    uint32_t FSOSCEN:1;
    uint32_t IESO:1;
    uint32_t POSCMOD:2;
    uint32_t OSCIOFNC:1;
    uint32_t :3;
    uint32_t FCKSM:2;
    uint32_t WDTPS:5;
    uint32_t WDTSPGM:1;
    uint32_t WINDIS:1;
    uint32_t FWDTEN:1;
    uint32_t FWDTWINSZ:2;
    uint32_t DMTCNT:5;
    uint32_t FDMTEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __DEVCFG1bits_t;
extern volatile __DEVCFG1bits_t DEVCFG1bits __asm__ ("DEVCFG1") __attribute__((section("sfrs"), address(0xBFC0FFC8)));
#define DEVCFG0 DEVCFG0
extern volatile uint32_t   DEVCFG0 __attribute__((section("sfrs"), address(0xBFC0FFCC)));
typedef union {
  struct {
    uint32_t DEBUG:2;
    uint32_t JTAGEN:1;
    uint32_t ICESEL:2;
    uint32_t TRCEN:1;
    uint32_t BOOTISA:1;
    uint32_t :1;
    uint32_t FECCCON:2;
    uint32_t FSLEEP:1;
    uint32_t :1;
    uint32_t DBGPER:3;
    uint32_t SMCLR:1;
    uint32_t SOSCGAIN:2;
    uint32_t SOSCBOOST:1;
    uint32_t POSCGAIN:2;
    uint32_t POSCBOOST:1;
    uint32_t POSCFGAIN:2;
    uint32_t POSCTYPE:2;
    uint32_t POSCAGCRNG:1;
    uint32_t POSCAGC:1;
    uint32_t :2;
    uint32_t EJTAGBEN:1;
  };
  struct {
    uint32_t :24;
    uint32_t POSCAGCDLY:2;
  };
  struct {
    uint32_t FDEBUG:2;
  };
  struct {
    uint32_t w:32;
  };
} __DEVCFG0bits_t;
extern volatile __DEVCFG0bits_t DEVCFG0bits __asm__ ("DEVCFG0") __attribute__((section("sfrs"), address(0xBFC0FFCC)));
#define DEVCP3 DEVCP3
extern volatile uint32_t   DEVCP3 __attribute__((section("sfrs"), address(0xBFC0FFD0)));
#define DEVCP2 DEVCP2
extern volatile uint32_t   DEVCP2 __attribute__((section("sfrs"), address(0xBFC0FFD4)));
#define DEVCP1 DEVCP1
extern volatile uint32_t   DEVCP1 __attribute__((section("sfrs"), address(0xBFC0FFD8)));
#define DEVCP0 DEVCP0
extern volatile uint32_t   DEVCP0 __attribute__((section("sfrs"), address(0xBFC0FFDC)));
typedef union {
  struct {
    uint32_t :28;
    uint32_t CP:1;
  };
  struct {
    uint32_t w:32;
  };
} __DEVCP0bits_t;
extern volatile __DEVCP0bits_t DEVCP0bits __asm__ ("DEVCP0") __attribute__((section("sfrs"), address(0xBFC0FFDC)));
#define DEVSIGN3 DEVSIGN3
extern volatile uint32_t   DEVSIGN3 __attribute__((section("sfrs"), address(0xBFC0FFE0)));
#define DEVSIGN2 DEVSIGN2
extern volatile uint32_t   DEVSIGN2 __attribute__((section("sfrs"), address(0xBFC0FFE4)));
#define DEVSIGN1 DEVSIGN1
extern volatile uint32_t   DEVSIGN1 __attribute__((section("sfrs"), address(0xBFC0FFE8)));
#define DEVSIGN0 DEVSIGN0
extern volatile uint32_t   DEVSIGN0 __attribute__((section("sfrs"), address(0xBFC0FFEC)));
#define SEQ3 SEQ3
extern volatile uint32_t   SEQ3 __attribute__((section("sfrs"), address(0xBFC0FFF0)));
typedef union {
  struct {
    uint32_t TSEQ:16;
    uint32_t CSEQ:16;
  };
  struct {
    uint32_t w:32;
  };
} __SEQ3bits_t;
extern volatile __SEQ3bits_t SEQ3bits __asm__ ("SEQ3") __attribute__((section("sfrs"), address(0xBFC0FFF0)));
#define SEQ2 SEQ2
extern volatile uint32_t   SEQ2 __attribute__((section("sfrs"), address(0xBFC0FFF4)));
#define SEQ1 SEQ1
extern volatile uint32_t   SEQ1 __attribute__((section("sfrs"), address(0xBFC0FFF8)));
#define SEQ0 SEQ0
extern volatile uint32_t   SEQ0 __attribute__((section("sfrs"), address(0xBFC0FFFC)));
#define DEVADC0 DEVADC0
extern volatile uint32_t   DEVADC0 __attribute__((section("sfrs"), address(0xBFC54000)));
typedef union {
  struct {
    uint32_t ADCFG:32;
  };
  struct {
    uint32_t w:32;
  };
} __DEVADC0bits_t;
extern volatile __DEVADC0bits_t DEVADC0bits __asm__ ("DEVADC0") __attribute__((section("sfrs"), address(0xBFC54000)));
#define DEVADC1 DEVADC1
extern volatile uint32_t   DEVADC1 __attribute__((section("sfrs"), address(0xBFC54004)));
typedef union {
  struct {
    uint32_t ADCFG:32;
  };
  struct {
    uint32_t w:32;
  };
} __DEVADC1bits_t;
extern volatile __DEVADC1bits_t DEVADC1bits __asm__ ("DEVADC1") __attribute__((section("sfrs"), address(0xBFC54004)));
#define DEVADC2 DEVADC2
extern volatile uint32_t   DEVADC2 __attribute__((section("sfrs"), address(0xBFC54008)));
typedef union {
  struct {
    uint32_t ADCFG:32;
  };
  struct {
    uint32_t w:32;
  };
} __DEVADC2bits_t;
extern volatile __DEVADC2bits_t DEVADC2bits __asm__ ("DEVADC2") __attribute__((section("sfrs"), address(0xBFC54008)));
#define DEVADC3 DEVADC3
extern volatile uint32_t   DEVADC3 __attribute__((section("sfrs"), address(0xBFC5400C)));
typedef union {
  struct {
    uint32_t ADCFG:32;
  };
  struct {
    uint32_t w:32;
  };
} __DEVADC3bits_t;
extern volatile __DEVADC3bits_t DEVADC3bits __asm__ ("DEVADC3") __attribute__((section("sfrs"), address(0xBFC5400C)));
#define DEVADC4 DEVADC4
extern volatile uint32_t   DEVADC4 __attribute__((section("sfrs"), address(0xBFC54010)));
typedef union {
  struct {
    uint32_t ADCFG:32;
  };
  struct {
    uint32_t w:32;
  };
} __DEVADC4bits_t;
extern volatile __DEVADC4bits_t DEVADC4bits __asm__ ("DEVADC4") __attribute__((section("sfrs"), address(0xBFC54010)));
#define DEVADC7 DEVADC7
extern volatile uint32_t   DEVADC7 __attribute__((section("sfrs"), address(0xBFC5401C)));
typedef union {
  struct {
    uint32_t ADCFG:32;
  };
  struct {
    uint32_t w:32;
  };
} __DEVADC7bits_t;
